/**
 * (c) 2016 The LV1RE Project.
 * Released under MIT license. Read LICENSE for more details.
 */

#pragma once

#include "common/types.h"


// LV1 RSX object video RSX object, size 0xC0
struct rsx_object_video_rsx_t {
    S08 unk_00;                  // 0x00: RSX LV1 debug level, 0(off) to 3(max debug output)
    S08 unk_01[3];               // 0x00: padding
    //--------------------------------------------------------------------
    S32 unk_04;                  // 0x04: ?
    S32 unk_08;                  // 0x08: ?
    S32 unk_0C;                  // 0x0C: ?
    S32 unk_10;                  // 0x10: ?
    S32 unk_14;                  // 0x14: ?
    S32 unk_18;                  // 0x18: ?
    S32 unk_1C;                  // 0x1C: ?
    S32 unk_20;                  // 0x20: ?
    //--------------------------------------------------------------------
    S32 unk_24[2];               // 0x24: ?
    //--------------------------------------------------------------------
    S32 unk_2C[3];               // 0x2C: [0], 
    // S32 unk_30;               // 0x30: [1], 
    // S32 unk_34;               // 0x34: [2], 
    //--------------------------------------------------------------------
    S64 unk_38;                  // 0x38: 
    S64 unk_40;                  // 0x40: 
    //--------------------------------------------------------------------
    S32 unk_48;                  // 0x48: ? init with 0x20200
    S32 unk_4C;                  // 0x4C: ? init with 0x20200
    //--------------------------------------------------------------------
    S08 unk_50;                  // 0x50: ?
    S08 unk_51;                  // 0x51: ?
    S08 unk_52;                  // 0x52: ?
    S08 unk_53;                  // 0x53: ?
    S08 unk_54;                  // 0x54: ?
    S08 unk_55;                  // 0x55: ?
    S08 unk_56;                  // 0x56: ?
    S08 unk_57;                  // 0x57: ?
    //--------------------------------------------------------------------
    S32 unk_58;                  // 0x58: ?
    S32 unk_5C;                  // 0x5C: ?
    S32 unk_60;                  // 0x60: ?
    S32 unk_64;                  // 0x64: ?
    S32 unk_68;                  // 0x68: ?
    S32 unk_6C;                  // 0x6C: ?
    S32 unk_70;                  // 0x70: ?
    S32 unk_74;                  // 0x74: ?
    //--------------------------------------------------------------------
    S08 unk_78[2];                // 0x78: ? 
    S08 unk_7A[2];                // 0x7A: padding
    S32 unk_7C[2];               // 0x7C: ?
    S32 unk_84[2];               // 0x84: ?
    //--------------------------------------------------------------------
    S32 unk_8C;                  // 0x8C: ?
    //--------------------------------------------------------------------
    S64 *unk_90;                 // 0x90: prt, unk lv1 obj
    S64 *unk_98;                 // 0x98: prt, unk lv1 obj
    //--------------------------------------------------------------------
    S64 unk_A0[2];               // 0xA0: ?
    //--------------------------------------------------------------------
    S64 unk_B0[2];               // 0xB0: ? clock

    // Methods
    //--- init -------------------------------------------------------------
    S32  sub223230(S32 arg1, S32 arg2);
    void sub222F2C(S32 arg1);
    S32  sub2231BC(S32 idx);
    S32  sub223510(S32 arg1, S32 arg2);
    void init();
    //----------------------------------------------------------------------

    void sub2245F4();
};
